app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT "documents".* FROM "documents"

  def create
    name = params[:document][:file].original_filename
    directory = "app/assets/images/"
    path = File.join(directory, name)
    File.open(path, "wb") { |f| f.write(params[:document][:file].read) }
    flash[:notice] = "File uploaded"

    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("filename", "content_type", "file_contents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]

    def set_document
      @document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", 4]]