app/controllers/upload_controller.rb

INSERT INTO "uploads" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-12 21:09:05.013190"], ["updated_at", "2016-04-12 21:09:05.013190"]]
---
  def create
	  name = params[:upload][:file].original_filename
    directory = "public/images/upload"
    path = File.join(directory, name)
    File.open(path, "wb") { |f| f.write(params[:upload][:file].read) }
    flash[:notice] = "File uploaded"

    @upload = Upload.new(upload_params)

    if @upload.save