app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
  def index
    @upload = Upload.all

SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @upload = Upload.find(params[:id])